In [1]:
import pandas as pd
# Series 객체 pd.Series(data{iterable,배열, scalar value, dict}, index, dtype) -> numpy의 1차원 배열과 비슷하나 인덱스를 붙여줌
# data: iterable,배열, scalar value, dict
# index: 반드시 유일할 필요 X hashable해야함(변하지 않음) 설정 안할 경우 rangeindex
series = pd.Series(["하나", "둘", "셋", "넷", "다섯","여섯", "일곱", "여덟", "아홉", "열"],
                  index = [_ for _ in range(1,11)])
series

1     하나
2      둘
3      셋
4      넷
5     다섯
6     여섯
7     일곱
8     여덟
9     아홉
10     열
dtype: object

In [2]:
series = pd.Series(['하나', '둘','셋'],
                   index = range(3))
series

0    하나
1     둘
2     셋
dtype: object

In [3]:
s =  pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052]
               ,index= ["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [4]:
S = pd.Series(range(10,100,10))
S

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [5]:
s.index # 문자의 경우 'object'타입

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [6]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [7]:
pd.Series()

C:\Users\user\AppData\Local\Temp\ipykernel_7224\2031691219.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series()

Series([], dtype: float64)

In [8]:
S = pd.Series(range(10, 100, 10))
(S.values > 50).sum()

4

In [9]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [10]:
d = {'a' : 1, 'b' : 2, 'c' : 3} # 비시퀀스(3.6버전 이후 순서 O)

# 데이터에 딕셔너리를 넣으면 key값만 인덱스에 올 수 있음
ser = pd.Series(data = d, index = ['c', 'a', 'b']) 
# 인덱스 순서 조정 시 값도 함께 변동

ser

c    3
a    1
b    2
dtype: int64

In [11]:
d = {'a':1, 'd':2, 'c':3}
ser = pd.Series(data=d, index=['x', 'y', 'z']) 
# d에 없는 값을 index에 사용할 경우 nan값을 가짐

In [12]:
s2 = pd.Series({"철수":88, "영희":95, "길동":100, "몽룡":67})
s2

철수     88
영희     95
길동    100
몽룡     67
dtype: int64

In [13]:
s2.철수, s2.영희, s2.길동, s2.몽룡
# index가 공백이 없는 문자열인 경우 위처럼 사용 가능

(88, 95, 100, 67)

In [14]:
"서울" in s

True

In [15]:
"대전" in s

False

In [16]:
for k, v in s.items(): 
    print(f"{k}, {v}")

서울, 9904312
부산, 3448737
인천, 2890451
대구, 2466052

In [17]:
test = dict(zip(range(10), list("영일이삼사오육칠팔구")))
test

{0: '영',
 1: '일',
 2: '이',
 3: '삼',
 4: '사',
 5: '오',
 6: '육',
 7: '칠',
 8: '팔',
 9: '구'}

In [18]:
test.keys()

dict_keys([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [19]:
test.values()

dict_values(['영', '일', '이', '삼', '사', '오', '육', '칠', '팔', '구'])

In [20]:
test.items()

dict_items([(0, '영'), (1, '일'), (2, '이'), (3, '삼'), (4, '사'), (5, '오'), (6, '육'), (7, '칠'), (8, '팔'), (9, '구')])

In [21]:
"영" in test

False

In [22]:
"영" in test.values()

True

In [23]:
9904312 in s.values

True

In [24]:
for index, value in s.items():
    if value > 3000000:
        print(f"{index}의 인구는 300만이 넘습니다.")

서울의 인구는 300만이 넘습니다.
부산의 인구는 300만이 넘습니다.

In [25]:
# Series도 벡터화 연산 가능
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [26]:
s[1], s["부산"] # 값만 가져옴

(3448737, 3448737)

In [27]:
s[3], s["대구"]

(2466052, 2466052)

In [28]:
s[[0,3,1]] # 인덱싱

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [29]:
s[["서울", "대구", "부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [30]:
s[[0]] # 하나의 값이라도 시리즈 형태로 가져옴

도시
서울    9904312
Name: 인구, dtype: int64

In [31]:
s[["인천"]]

도시
인천    2890451
Name: 인구, dtype: int64

In [32]:
s[1:3] # 두번째부터 세번째까지

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [33]:
s["부산":"대구"] # 부산에서 대구까지(대구도 포함)

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [34]:
s2 = pd.Series({"서울": 9631482, "부산":3393191, "인천":2632035, "대전":1490158})
s,s2 # 대구, 대전

(도시
 서울    9904312
 부산    3448737
 인천    2890451
 대구    2466052
 Name: 인구, dtype: int64,
 서울    9631482
 부산    3393191
 인천    2632035
 대전    1490158
 dtype: int64)

In [35]:
ds = s - s2
ds
# nan값과 연산 시 nan값이 나옴
# 전체 타입이 float이 됨을 주의

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [36]:
ds.isnull() # nan값 확인

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [37]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [38]:
ds[ds.notnull()] 
# bool indexing 필터링 numpy처럼 사용 가능
# 결측치 제외

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [39]:
s[s > 3000000]

도시
서울    9904312
부산    3448737
Name: 인구, dtype: int64

In [40]:
# s -> 2015년 인구
# s2 -> 2010년 인구
rs = (s - s2) / s2 * 100 # 인구 증가율 
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

r = s - s2
r = r[r.notnull()]
r[[r.argmax()]]

In [41]:
a = dict(zip(range(10),list("영일시삼사오육칠팔구")))

In [42]:
a[0] = 'zero'
a

{0: 'zero',
 1: '일',
 2: '시',
 3: '삼',
 4: '사',
 5: '오',
 6: '육',
 7: '칠',
 8: '팔',
 9: '구'}

In [43]:
rs["부산"] = 1.63 # 데이터 갱신
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [44]:
rs["서울":"인천"] = 2.89, 9.82
rs

부산    1.63
서울    2.89
인천    9.82
dtype: float64

In [45]:
rs

부산    1.63
서울    2.89
인천    9.82
dtype: float64

In [46]:
rs["대구"] = 1.41 # 데이터 추가

In [47]:
del rs["서울"] # 데이터 삭제

In [48]:
rs

부산    1.63
인천    9.82
대구    1.41
dtype: float64

In [49]:
fin1 = {"카카오":60010, "삼성전자":61000, "LG전자":90000}
fin2_value = [60200, 61200, 200100]
fin2_index = ["카카오", "삼성전자", "네이버"]
ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value, index = fin2_index)

In [50]:
ser_finance2

카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [51]:
ser_finance1 - ser_finance2

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [52]:
ser_finance1 + ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [53]:
ser_finance1 * ser_finance2

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [54]:
ser_finance1 / ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [55]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

In [56]:
result

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [57]:
# pandas.DataFrame(data = series, index, columns, dtype, copy)
# 각 컬럼마다 자료형이 다를 수 있음

In [58]:
d = {'col1':[1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data = d,index = ['r1', 'r2'])
df

    col1  col2
r1     1     3
r2     2     4

In [59]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762546, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율" :[0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"] # 순서 지정
index = ["서울", "부산", "인천", "대구"] # 행 인덱스
df = pd.DataFrame(data, index = index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [60]:
df.dtypes

지역                object
2015               int64
2010               int64
2005               int64
2000               int64
2010-2015 증가율    float64
dtype: object

In [61]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [62]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [63]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [64]:
df.index.name = "도시"

In [65]:
df.columns.name = "특성"

In [66]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [67]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [68]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [69]:
type(df["2010-2015 증가율"])

pandas.core.series.Series

In [70]:
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [71]:
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [73]:
df["지역"] # 하나의 컬럼만 인덱싱하면 시리즈 반환

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [74]:
df[["2010", "2015"]] # 여려 개의 컬럼 인덱싱 시 부분 dataframe 반환

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [82]:
df[["2010"]] # 컬럼 인덱스가 문자열일 때 정수 인덱스 사용 시 KeyError 발생

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [80]:
df[:1] # row단위 인덱싱은 슬라이싱만 가능, index가 문자일 경우 label 슬라이싱도 가능
df["서울":"인천"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54

In [86]:
df["2015"]["서울"] #df[colummn][row]

도시
서울    9904312
Name: 2015, dtype: int64

In [84]:
type(df["2015"]["서울"])

numpy.int64

In [144]:
data = {
    "국어":[80, 90, 70, 30],
    "영어":[90,70,60,40],
    "수학":[90, 60, 80,70]
}
columns = ["국어","영어","수학"]
index = ["춘향","몽룡","향단","방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df["수학"]
df[["국어","영어"]]
df["평균"]=round(df.mean(axis=1),2)
df[:1]
df.T["향단"]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [142]:
df

    국어  영어  수학  평균
춘향  80  90  90 NaN
몽룡  90  70  60 NaN
향단  70  60  80 NaN
방자  30  40  70 NaN

In [156]:
import numpy as np
import pandas as pd
np.random.seed(0)
df = pd.DataFrame(np.random.randn(24).reshape(6,4),
                  columns = ['A','B','C','D'],
                  index =  pd.date_range("20130226", periods = 6))
df

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165